{
  "name": "RoofSense",
  "images": {
    "path": "imgs/{id}.tif"
  },
  "classes": [
    {
      "name": "Asphalt Shingles",
      "description": "The set of pixels representing asphalt shingles. This material is common in pitched, dark-colored roofs with straight-line-like attributes both along and across their surface due to the overlap between adjacent roofing elements. See https://en.wikipedia.org/wiki/Asphalt_shingle for more information",
      "colour": [
        141,
        211,
        199,
        85
      ]
    },
    {
      "name": "Bituminous Membranes",
      "description": "The set of pixels representing bituminous membranes. This material is common in small- to medium-sized, flat, dark-colored roofs. See https://en.wikipedia.org/wiki/Bituminous_waterproofing for more information.",
      "colour": [
        255,
        255,
        179,
        85
      ]
    },
    {
      "name": "Clay Tiles",
      "description": "The set of pixels representing clay tiles. This material is common in pitched, residential roofs and commonly appears yellow or yellowish brown in false-color imagery.",
      "colour": [
        190,
        186,
        218,
        85
      ]
    },
    {
      "name": "Loose Gravel",
      "description": "The set of pixels representing loose gravel. This material is common in medium- to large-sized, flat, gray-colored roofs.",
      "colour": [
        251,
        128,
        114,
        85
      ]
    },
    {
      "name": "Metal",
      "description": "The set of pixels representing bare or colored metal of any type. This material is common in church bell and tower-like structures and can appear blue-green or golden-brown in true-color imagery, or exceedingly bright in reflectance maps due to its non-Lambertian behavior when polished.",
      "colour": [
        128,
        117,
        211,
        85
      ]
    },
    {
      "name": "Solar Panels",
      "description": "The set of pixels representing solar and photovoltaic panel installations (i.e., the panels, their brackets and underlying base structure).",
      "colour": [
        253,
        185,
        98,
        85
      ]
    },
    {
      "name": "Vegetation",
      "description": "The set of pixels representing vegetation.",
      "colour": [
        179,
        222,
        105,
        85
      ]
    },
    {
      "name": "Other",
      "description": "The set of pixels representing any roofing material or roof superstructure which does not belong to one of the predefined classes (e.g., non-bituminous coatings, concrete or gravel tiles, glass, chimneys, heating, ventilation and air conditioning systems, etc.).",
      "colour": [
        252,
        205,
        229,
        85
      ]
    },
    {
      "name": "Invalid",
      "description": "The set of pixels representing ambiguous areas which do not belong to roofs [e.g., the background (see below) and other building parts (e.g., facades) due to data distortion and relevant misalignment issues, etc.]. THIS CLASS SHOULD BE USED TO ANNOTATE THE BACKGROUND!",
      "colour": [
        255,
        255,
        255,
        170
      ]
    },
    {
      "name": "__ignore__",
      "description": "The set of pixels representing the background (i.e., regions which are on the exterior of the roof surfaces extracted from the 3DBAG and have thus been excluded from the training data). THIS CLASS IS INTERNAL AND SHOULD NOT BE USED!",
      "colour": [
        255,
        255,
        255,
        0
      ]
    }
  ],
  "views": {
    "True-color (R-G-B)": {
      "description": "The true-color composite of the area corresponding to this patch.",
      "type": "image",
      "data": [
        "$B1",
        "$B2",
        "$B3"
      ]
    },
    "False-color (NIR-R-G)": {
      "description": "The false-color composite of the area corresponding to this patch.",
      "type": "image",
      "data": [
        "$B4",
        "$B1",
        "$B2"
      ]
    },
    "Reflectance": {
      "description": "The material reflectance field of the area corresponding to this patch.",
      "type": "image",
      "data": "$B5",
      "cmap": "turbo",
      "vmax": 1
    },
    "Slope": {
      "description": "The slope field of the digital surface model of the area corresponding to this patch.",
      "type": "image",
      "data": "$B6",
      "cmap": "turbo"
    }
  },
  "view_groups": {
    "default": [
      "True-color (R-G-B)",
      "False-color (NIR-R-G)"
    ],
    "LiDAR": [
      "Reflectance",
      "Slope"
    ]
  },
  "segmentation": {
    "path": "msks/{id}.tif",
    "mask_encoding": "integer"
  }
}
